Revit 2026 API

# RebarFreeFormAccessorAlignedFreeFormSetOrientationOptions Property

---

Orientation options for an Aligned Free Form Rebar set.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public AlignedFreeFormSetOrientationOptions AlignedFreeFormSetOrientationOptions { get; set; }
```
```vb
Public Property AlignedFreeFormSetOrientationOptions As AlignedFreeFormSetOrientationOptions
	Get
	Set
```
```cpp
public:
property AlignedFreeFormSetOrientationOptions AlignedFreeFormSetOrientationOptions {
	AlignedFreeFormSetOrientationOptions get ();
	void set (AlignedFreeFormSetOrientationOptions value);
}
```
```fsharp
member AlignedFreeFormSetOrientationOptions : AlignedFreeFormSetOrientationOptions with get, set
```

#### Property Value

AlignedFreeFormSetOrientationOptions

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |
| InvalidOperationException | This RebarFreeFormAccessor doesn't contain a valid rebar reference. -or- This RebarFreeFormAccessor Rebar is not created with the Aligned Free Form rebar server. |

#### Reference

RebarFreeFormAccessor Class

Autodesk.Revit.DB.Structure Namespace